Autodesk.Revit.DB.Mechanical.DuctSettings.IsNetworkBasedCalculationsEnabled(Autodesk.Revit.DB.Document)
Indicates whether network based calculations for duct networks is enabled in the specified document.
document:
The document.
Returns:
Returns true if network based calculations for duct networks is enabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.SetPressLossCalculationServerInfo(Autodesk.Revit.DB.MEPCalculationServerInfo)
Set the MEPServerInfo of the current pipe pressure loss calculation server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.GetDuctSettings(Autodesk.Revit.DB.Document)
Get the duct settings of the project.
document:
The document.
Returns:
The duct settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.NetworkBasedCalculations
Indicates whether to enable network based calculations for duct networks.
Since:
2024

Autodesk.Revit.DB.Mechanical.DuctSettings.AirViscosity
The kinematic viscosity of air in ft^2/s.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.AirDensity
The air density in kg/ft^3.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.Centerline
The abbreviation of the Centerline (=) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.SetDownFromBottom
The abbreviation of the Set Down from bottom (BD) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Mechanical.DuctSettings.SetUpFromBottom
The abbreviation of the Set Up from bottom (BU) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Mechanical.DuctSettings.SetDown
The abbreviation of the Set Down from top (TD) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.SetUp
The abbreviation of the Set Up  from top (TU) of fitting string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnBottom
The abbreviation of the Flat On Bottom (FOB) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnTop
The abbreviation of the Flat On Top (FOT) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSuffix
The oval duct size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSeparator
The oval duct size separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.ConnectorSeparator
The duct connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizePrefix
The round duct size prefix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizeSuffix
The round duct size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSuffix
The rectangular duct size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSeparator
The rectangular duct size separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014